wero1414/Reto_NXP/secure_lab/secure_s/board/pin_mux.c
        const uint32_t port0_pin20_config = (/* Pin is configured as FC7_RXD_SDA_MOSI_DATA */
                                             IOCON_PIO_FUNC7 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN20 (coords: 74) is configured as FC7_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 20U, port0_pin20_config);

        const uint32_t port0_pin21_config = (/* Pin is configured as FC7_SCK */
                                             IOCON_PIO_FUNC7 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN21 (coords: 76) is configured as FC7_SCK */
        IOCON_PinMuxSet(IOCON, 0U, 21U, port0_pin21_config);

        const uint32_t port1_pin20_config = (/* Pin is configured as FC7_RTS_SCL_SSEL1 */
                                             IOCON_PIO_FUNC1 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN20 (coords: 4) is configured as FC7_RTS_SCL_SSEL1 */
        IOCON_PinMuxSet(IOCON, 1U, 20U, port1_pin20_config);


        //FLEXCOM8

        const uint32_t port0_pin26_config = (/* Pin is configured as HS_SPI_MOSI */
                                                 IOCON_PIO_FUNC9 |
                                                 /* No addition pin function */
                                                 IOCON_PIO_MODE_INACT |
                                                 /* Fast mode, slew rate control is disabled */
                                                 IOCON_PIO_SLEW_FAST |
                                                 /* Input function is not inverted */
                                                 IOCON_PIO_INV_DI |
                                                 /* Enables digital function */
                                                 IOCON_PIO_DIGITAL_EN |
                                                 /* Open drain is disabled */
                                                 IOCON_PIO_OPENDRAIN_DI);
            /* PORT0 PIN26 (coords: 60) is configured as HS_SPI_MOSI */
            IOCON_PinMuxSet(IOCON, 0U, 26U, port0_pin26_config);

            const uint32_t port1_pin1_config = (/* Pin is configured as HS_SPI_SSEL1 */
                                                IOCON_PIO_FUNC5 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Fast mode, slew rate control is disabled */
                                                IOCON_PIO_SLEW_FAST |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI);
            /* PORT1 PIN1 (coords: 59) is configured as HS_SPI_SSEL1 */
            IOCON_PinMuxSet(IOCON, 1U, 1U, port1_pin1_config);

            const uint32_t port1_pin2_config = (/* Pin is configured as HS_SPI_SCK */
                                                IOCON_PIO_FUNC6 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Fast mode, slew rate control is disabled */
                                                IOCON_PIO_SLEW_FAST |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI);
            /* PORT1 PIN2 (coords: 61) is configured as HS_SPI_SCK */
            IOCON_PinMuxSet(IOCON, 1U, 2U, port1_pin2_config);

            const uint32_t port1_pin3_config = (/* Pin is configured as HS_SPI_MISO */
                                                IOCON_PIO_FUNC6 |
                                                /* No addition pin function */
                                                IOCON_PIO_MODE_INACT |
                                                /* Fast mode, slew rate control is disabled */
                                                IOCON_PIO_SLEW_FAST |
                                                /* Input function is not inverted */
                                                IOCON_PIO_INV_DI |
                                                /* Enables digital function */
                                                IOCON_PIO_DIGITAL_EN |
                                                /* Open drain is disabled */
                                                IOCON_PIO_OPENDRAIN_DI);
            /* PORT1 PIN3 (coords: 62) is configured as HS_SPI_MISO */
            IOCON_PinMuxSet(IOCON, 1U, 3U, port1_pin3_config);


    IOCON->PIO[0][5] = ((IOCON->PIO[0][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK)))

                        /* Selects pin function.
                         * : PORT05 (pin 88) is configured as SECURE_GPIO0_5. */
                        | IOCON_PIO_FUNC(0x0Au));

