wero1414/Reto_NXP/secure_lab/secure_s/board/pin_mux.c
    IOCON->PIO[1][18] = ((IOCON->PIO[1][18] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT118 (pin 64) is configured as PIO1_18. */
                         | IOCON_PIO_FUNC(PIO1_18_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-up.
                          * Pull-up resistor enabled. */
                         | IOCON_PIO_MODE(PIO1_18_MODE_PULL_UP)

                         /* Select Digital mode.
                          * : Digital mode, digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_18_DIGIMODE_DIGITAL));

//    IOCON->PIO[1][9] = ((IOCON->PIO[1][9] &
//    		/* Mask bits to zero which are setting */
//    		(~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))
//
//    		/* Selects pin function.
//    		 * : PORT19 (pin 10) is configured as PIO1_9. */
//    		| IOCON_PIO_FUNC(PIO1_9_FUNC_ALT0)
//
//			/* Selects function mode (on-chip pull-up/pull-down resistor control).
//			 * : Pull-up.
//			 * Pull-up resistor enabled. */
//			| IOCON_PIO_MODE(PIO1_9_MODE_PULL_UP)
//
//			/* Select Digital mode.
//			 * : Digital mode, digital input is enabled. */
//			| IOCON_PIO_DIGIMODE(PIO1_9_DIGIMODE_DIGITAL));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
